diffusionFvOptions/testCases/rhoReactingFoam_diffusion_hConst/system/setFieldsDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue H2O 0
    volScalarFieldValue N2 1
);

regions
(
    boxToCell
    {
        box	 (0.0 0.0 -1.0) (0.5 0.5 1.0); 

        fieldValues
        (
            volScalarFieldValue H2O 0.0
            volScalarFieldValue N2 1.0
        );
    }
    boxToCell
    {
        box	 (0.0 -0.5 -1.0) (0.5 0.0 1.0); 

        fieldValues
        (
            volScalarFieldValue H2O 1.0
            volScalarFieldValue N2 0.0
        );
    }
);


// ************************************************************************* //
